
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипЗаполнения = 1;
	Объект.ДатаЗагрузки = ТекущаяДата();
	ДатаЗагрузки = Объект.ДатаЗагрузки;
	ЗаполнениеГрафика(ТипЗаполнения);
	
	МассивВалют = ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере(ДатаЗагрузки);
	// Обращение к первой структуре (ТаблицаUSD)
	ТаблицаUSD = МассивВалют[0];
	
	// Обращение ко второй структуре (ТаблицаEURO)
	ТаблицаEURO = МассивВалют[1];
	
	// Обращение к третьей структуре (ТаблицаCNY)
	ТаблицаCNY = МассивВалют[2];
	
	// Заполняем реквизиты формы
	КурсДоллараНаСегодня = ТаблицаUSD["Значение"];
	КурсЕвроНаСегодня = ТаблицаEURO["Значение"];
	КурсЮаняНаСегодня = ТаблицаCNY["Значение"];
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере(ДатаЗагрузки)
	
	Сервер = "cbr.ru"; //1
	АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ДатаЗагрузки, "ДФ=dd/MM/yyyy"); //2
	
	ВозвращаемоеЗначение = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса); //3
	
	Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда //4
		Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
		Отказ = Истина;
	ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда //5
		Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
		Отказ = Истина;
	КонецЕсли;
	
	СтрокаXML = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку(); //6 
	
	//Читаем результат запроса
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML); //1
	
	Валюта = Неопределено;
	
	ТаблицаUSD = Новый Структура;
	ТаблицаUSD.Вставить("Дата",Элементы.ДатаЗагрузки);
	ТаблицаEURO = Новый Структура;
	ТаблицаEURO.Вставить("Дата",Элементы.ДатаЗагрузки);
	ТаблицаCNY = Новый Структура;
	ТаблицаCNY.Вставить("Дата",Элементы.ДатаЗагрузки);
	
	
	Пока ЧтениеXML.Прочитать() Цикл //2
		
		//Через Postman или браузер узнаем нужные ID по ссылке https://cbr.ru/scripts/XML_daily.asp?date_req=12/02/2026
		//ищем ID= R01235 (доллар) R01375 (юань) R01239 (евро)
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НужнаяВалюта = Ложь;
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл //3
				Если  ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01235" Тогда
					Валюта = "USD";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01239" Тогда
					Валюта = "EURO";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01375" Тогда
					Валюта = "CNY";
				Иначе
					Валюта = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Валюта <> Неопределено
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "VunitRate" Тогда
			ЧтениеXML.Прочитать();
			Если Валюта = "USD" Тогда //4
				ТаблицаUSD.Вставить("Значение",ЧтениеXML.Значение);
				ТаблицаUSD.Вставить("Валюта","USD");
			ИначеЕсли Валюта = "EURO" Тогда
				ТаблицаEURO.Вставить("Значение",ЧтениеXML.Значение);
				ТаблицаEURO.Вставить("Валюта","EURO");
			ИначеЕсли Валюта = "CNY" Тогда
				ТаблицаCNY.Вставить("Значение",ЧтениеXML.Значение);
				ТаблицаCNY.Вставить("Валюта","CNY");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	МассивВалют = Новый Массив;
	МассивВалют.Вставить(0,ТаблицаUSD);
	МассивВалют.Вставить(1,ТаблицаEURO);
	МассивВалют.Вставить(2,ТаблицаCNY);
	
	Возврат МассивВалют;
	
КонецФункции

&НаКлиенте
Процедура ТипЗаполненияПриИзменении(Элемент)
	ЗаполнениеГрафика(ТипЗаполнения);
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеГрафика(ТипЗаполнения)
	
	СуткиВСекундах = 86400;
	
	Если ТипЗаполнения = "1" Тогда
		ДатаЗагрузки = Объект.ДатаЗагрузки - (СуткиВСекундах*6);
		КонечноеЗначениеСчетчика = 7;
		ШагВЦикле = СуткиВСекундах;
	ИначеЕсли ТипЗаполнения = "2" Тогда
		ДатаЗагрузки = Объект.ДатаЗагрузки - (СуткиВСекундах*29);
		КонечноеЗначениеСчетчика = 30;
		ШагВЦикле = СуткиВСекундах;
	КонецЕсли;
	
	
	ТаблицаЗначенийВалют = Новый ТаблицаЗначений;
	ТаблицаЗначенийВалют.Колонки.Добавить("USD", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийВалют.Колонки.Добавить("EURO",Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийВалют.Колонки.Добавить("CNY",Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийВалют.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
	
	Индекс=0;
	
	Для СЧ=1 По КонечноеЗначениеСчетчика Цикл
		
		МассивВалют = ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере(ДатаЗагрузки);
		
		// Обращение к первой структуре (ТаблицаUSD)
		ТаблицаUSD = МассивВалют[0];
		
		// Обращение ко второй структуре (ТаблицаEURO)
		ТаблицаEURO = МассивВалют[1];
		
		// Обращение к третьей структуре (ТаблицаCNY)
		ТаблицаCNY = МассивВалют[2];
		
		// Создаём новую строку
		НоваяСтрока = ТаблицаЗначенийВалют.Вставить(Индекс);
		// Устанавливаем значение для колонки в новой строке
		НоваяСтрока.USD = ТаблицаUSD["Значение"];
		НоваяСтрока.EURO = ТаблицаEURO["Значение"];
		НоваяСтрока.CNY = ТаблицаCNY["Значение"];
		НоваяСтрока.Дата = ДатаЗагрузки;
		
		ДатаЗагрузки = ДатаЗагрузки + ШагВЦикле;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	ДинамикаСтоимости.Обновление = Ложь;
	ДинамикаСтоимости.Очистить();
	//
	СерияUSD = ДинамикаСтоимости.Серии.Добавить("USD"); //2
	СерияUSD.Цвет = WebЦвета.Зеленый;
	СерияEURO = ДинамикаСтоимости.Серии.Добавить("EURO"); //2
	СерияEURO.Цвет = WebЦвета.Синий;
	СерияCNY = ДинамикаСтоимости.Серии.Добавить("CNY"); //2
	СерияCNY.Цвет = WebЦвета.Желтый;
	
	Для Каждого СтрокаТЧ Из ТаблицаЗначенийВалют Цикл
		Точка = ДинамикаСтоимости.Точки.Добавить(СтрокаТЧ.Дата);
		Точка.Текст = Формат(СтрокаТЧ.Дата, "ДФ=dd.MM.yy");
		Точка.Расшифровка = СтрокаТЧ.Дата;
		Подсказка = "Курс валют на " + Формат(СтрокаТЧ.Дата, "ДФЛ=dd.MM.yy");  
		ДинамикаСтоимости.УстановитьЗначение(Точка, СерияUSD, СтрокаТЧ.USD, Точка.Расшифровка, Подсказка);
		ДинамикаСтоимости.УстановитьЗначение(Точка, СерияEURO, СтрокаТЧ.EURO, Точка.Расшифровка, Подсказка);
		ДинамикаСтоимости.УстановитьЗначение(Точка, СерияCNY, СтрокаТЧ.CNY, Точка.Расшифровка, Подсказка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
	ЗаполнениеГрафика(ТипЗаполнения)
КонецПроцедуры



